package ru.k.kbook.domain

import ru.k.kbook.data.DishRepositoryImpl

/**
 * Формулы КБЖУ
 * Калорийность порции = Σ (калорийность продукта на 100 г × количество продукта в порции / 100) — для всех продуктов в составе
 * Белки порции = Σ (белки продукта на 100 г × количество продукта в порции / 100) — для всех продуктов в составе
 * Жиры порции = Σ (жиры продукта на 100 г × количество продукта в порции / 100) — для всех продуктов в составе
 * Углеводы порции = Σ (углеводы продукта на 100 г × количество продукта в порции / 100) — для всех продуктов в составе
 */
class KbjuCalculator {

}
